АлогистикТест2/src/DataProcessors/алк_РМ_ПривязкаПакетовКАддендуму/алк_РМ_ПривязкаПакетовКАддендуму.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>алк_РМ_ПривязкаПакетовКАддендуму</name>
  <attributes>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПроизводству</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>127</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отгружено</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Произведено</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пакеты</name>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Новый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Отгружено</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийАддендум</name>
      <type>
        <types>DocumentRef.алк_Аддендумы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

АлогистикТест2/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Несортированный</name>
      <description>Несортированный</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
  </predefined>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаркировки</name>
    <type>
      <types>EnumRef.ВидыМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыписыватьГарантийныйТалон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГарантийныйСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПрайсЛистов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПартии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраницаОстатков</name>
    <comment>Используется в прайс-листе при выводе остатков в виде представления</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендуемЗаказать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияФлагаНовинка</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПополнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭДГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоНовинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяНоменклатураВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто (кг)</comment>
    <type>
      <types>DefinedType.Вес</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>DefinedType.Объем</types>
    </type>
  </attributes>
  <attributes>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНаАнглийском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/DataProcessors/алк_РМ_ПривязкаПакетовКАддендуму/Forms/ФормаПодбораПакетов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Аддендум") Тогда
		ТолькоСвободные = Истина;
	    Список.Параметры.УстановитьЗначениеПараметра("Аддендум", Параметры.Аддендум); 
		Если Параметры.Аддендум.Товары[0].Номенклатура = Справочники.Номенклатура.НайтиПоКоду("ПБ-00000001") Тогда 
			Элементы.КатегорияНоменклатурыПЭО.Видимость = Истина;
			Элементы.Припуск.Видимость = Истина;
		КонецЕсли
	КонецЕсли;
	
	Если Параметры.Свойство("ИдентификаторТовара") Тогда
	    Список.Параметры.УстановитьЗначениеПараметра("ИдентификаторТовара", Параметры.ИдентификаторТовара);
	КонецЕсли;
	
	Если Параметры.Свойство("Номенклатура") Тогда
	    Номенклатура = Параметры.Номенклатура;
		КатегорияНоменклатуры = Параметры.Номенклатура.КатегорияНоменклатуры;
	КонецЕсли;     
	
КонецПроцедуры 

&НаСервере
Процедура УстановитьПараметрыОтбораСервер()  
	
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоСвободные", ТолькоСвободные);
	Список.Параметры.УстановитьЗначениеПараметра("УчитыватьКатегориюПЭО", УчитыватьКатегориюПЭО);
	Список.Параметры.УстановитьЗначениеПараметра("УчитыватьПрипуск", УчитыватьПрипуск);
		
	Список.Параметры.УстановитьЗначениеПараметра("Порода", Порода.ВыгрузитьЗначения());
	Список.Параметры.УстановитьЗначениеПараметра("Сорт", Сорт.ВыгрузитьЗначения());
	Список.Параметры.УстановитьЗначениеПараметра("Длина", Длина.ВыгрузитьЗначения());
	Список.Параметры.УстановитьЗначениеПараметра("Сечение", Сечение.ВыгрузитьЗначения());
	Список.Параметры.УстановитьЗначениеПараметра("Влажность", Влажность.ВыгрузитьЗначения());
	
	Если Порода.Количество()>0 Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеПорода", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеПорода", Истина);
	КонецЕсли; 
	
	Если Сорт.Количество()>0 Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСорт", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСорт", Истина);
	КонецЕсли;

	Если Длина.Количество()>0 Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеДлина", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеДлина", Истина);
	КонецЕсли;

	Если Сечение.Количество()>0 Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСечение", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеСечение", Истина);
	КонецЕсли;

	Если Влажность.Количество()>0 Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("ВсеВлажность", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ВсеВлажность", Истина);
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура УстановитьПараметрыОтбора(Элемент)
	УстановитьПараметрыОтбораСервер();
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПараметрыОтбораСервер(); 
КонецПроцедуры
